{
  "movies": [
    {
      "id": "MOV1",
      "type": "movie",
      "title": "Avengers: Endgame",
      "year": "2019",
      "genre": "Action/Sci-fi",
      "rating": 8.4,
      "description": "Adrift in space with no food or water, Tony Stark sends a message to Pepper Potts as his oxygen supply starts to dwindle. Meanwhile, the remaining Avengers -- Thor, Black Widow, Captain America and Bruce Banner -- must figure out a way to bring back their vanquished allies for an epic showdown with Thanos -- the evil demigod who decimated the planet and the universe.",
      "poster": "https://images-na.ssl-images-amazon.com/images/I/71niXI3lxlL._AC_SY741_.jpg",
      "trailer": "https://youtu.be/TcMBFSGVi1c"
    },
    {
      "id": "MOV2",
      "type": "movie",
      "title": "Avengers: Infinity War",
      "year": "2018",
      "genre": "Action/Sci-fi",
      "rating": 8.4,
      "description": "Iron Man, Thor, the Hulk and the rest of the Avengers unite to battle their most powerful enemy yet -- the evil Thanos. On a mission to collect all six Infinity Stones, Thanos plans to use the artifacts to inflict his twisted will on reality. The fate of the planet and existence itself has never been more uncertain as everything the Avengers have fought for has led up to this moment.",
      "poster": "https://images-na.ssl-images-amazon.com/images/I/71t--RaUiNL._AC_SY879_.jpg",
      "trailer": "https://youtu.be/QwievZ1Tx-8"
    },
    {
      "id": "MOV3",
      "type": "movie",
      "title": "Avengers: Age of Ultron",
      "year": "2015",
      "genre": "Action/Sci-fi",
      "rating": 7.3,
      "description": "When Tony Stark (Robert Downey Jr.) jump-starts a dormant peacekeeping program, things go terribly awry, forcing him, Thor (Chris Hemsworth), the Incredible Hulk (Mark Ruffalo) and the rest of the Avengers to reassemble. As the fate of Earth hangs in the balance, the team is put to the ultimate test as they battle Ultron, a technological terror hell-bent on human extinction. Along the way, they encounter two mysterious and powerful newcomers, Pietro and Wanda Maximoff.",
      "poster": "https://images-na.ssl-images-amazon.com/images/I/71wV2rzkFwL._AC_SL1022_.jpg",
      "trailer": "https://youtu.be/tmeOjFno6Do"
    },
    {
      "id": "MOV4",
      "type": "movie",
      "title": "The Avengers",
      "year": "2012",
      "genre": "Action/Sci-fi",
      "rating": 8.0,
      "description": "When Thor's evil brother, Loki (Tom Hiddleston), gains access to the unlimited power of the energy cube called the Tesseract, Nick Fury (Samuel L. Jackson), director of S.H.I.E.L.D., initiates a superhero recruitment effort to defeat the unprecedented threat to Earth. Joining Fury's \"dream team\" are Iron Man (Robert Downey Jr.), Captain America (Chris Evans), the Hulk (Mark Ruffalo), Thor (Chris Hemsworth), the Black Widow (Scarlett Johansson) and Hawkeye (Jeremy Renner).",
      "poster": "https://images-na.ssl-images-amazon.com/images/I/719SFBdxRtL._AC_SL1000_.jpg",
      "trailer": "https://youtu.be/eOrNdBpGMv8"
    },
    {
      "id": "MOV5",
      "type": "movie",
      "title": "Spider-Man: Far From Home",
      "year": "2019",
      "genre": "Action/Adventure",
      "rating": 7.5,
      "description": "Peter Parker's relaxing European vacation takes an unexpected turn when Nick Fury shows up in his hotel room to recruit him for a mission. The world is in danger as four massive elemental creatures -- each representing Earth, air, water and fire -- emerge from a hole torn in the universe. Parker soon finds himself donning the Spider-Man suit to help Fury and fellow superhero Mysterio stop the evil entities from wreaking havoc across the continent.",
      "poster": "https://i.pinimg.com/originals/58/3f/e4/583fe4b6d96d9cb8bbf0ae2b2749289d.png",
      "trailer": "https://youtu.be/Nt9L1jCKGnE"
    },
    {
      "id": "MOV6",
      "type": "movie",
      "title": "Spider-Man: Homecoming",
      "year": "2017",
      "genre": "Action/Adventure",
      "rating": 7.4,
      "description": "Thrilled by his experience with the Avengers, young Peter Parker returns home to live with his Aunt May. Under the watchful eye of mentor Tony Stark, Parker starts to embrace his newfound identity as Spider-Man. He also tries to return to his normal daily routine -- distracted by thoughts of proving himself to be more than just a friendly neighborhood superhero. Peter must soon put his powers to the test when the evil Vulture emerges to threaten everything that he holds dear.",
      "poster": "https://images-na.ssl-images-amazon.com/images/I/A1CcbJfKqJL._AC_SY679_.jpg",
      "trailer": "https://youtu.be/xrzXIaTt99U"
    },
    {
      "id": "MOV7",
      "type": "movie",
      "title": "Thor: Ragnarok",
      "year": "2017",
      "genre": "Action/Sci-fi",
      "rating": 7.9,
      "description": "Imprisoned on the other side of the universe, the mighty Thor finds himself in a deadly gladiatorial contest that pits him against the Hulk, his former ally and fellow Avenger. Thor's quest for survival leads him in a race against time to prevent the all-powerful Hela from destroying his home world and the Asgardian civilization.",
      "poster": "https://images-na.ssl-images-amazon.com/images/I/A1HBBNzBdxL._AC_SL1500_.jpg",
      "trailer": "https://youtu.be/ODqPGttjjOY"
    },
    {
      "id": "MOV8",
      "type": "movie",
      "title": "Thor: The Dark World",
      "year": "2013",
      "genre": "Action/Fantasy",
      "rating": 6.9,
      "description": "In ancient times, the gods of Asgard fought and won a war against an evil race known as the Dark Elves. The survivors were neutralized, and their ultimate weapon -- the Aether -- was buried in a secret location. Hundreds of years later, Jane Foster (Natalie Portman) finds the Aether and becomes its host, forcing Thor (Chris Hemsworth) to bring her to Asgard before Dark Elf Malekith (Christopher Eccleston) captures her and uses the weapon to destroy the Nine Realms -- including Earth.",
      "poster": "https://images-na.ssl-images-amazon.com/images/I/51JHjkMiujL._AC_.jpg",
      "trailer": "https://youtu.be/npvJ9FTgZbM"
    },
    {
      "id": "MOV9",
      "type": "movie",
      "title": "Thor",
      "year": "2010",
      "genre": "Action/Fantasy",
      "rating": 7.0,
      "description": "As the son of Odin (Anthony Hopkins), king of the Norse gods, Thor (Chris Hemsworth) will soon inherit the throne of Asgard from his aging father. However, on the day that he is to be crowned, Thor reacts with brutality when the gods' enemies, the Frost Giants, enter the palace in violation of their treaty. As punishment, Odin banishes Thor to Earth. While Loki (Tom Hiddleston), Thor's brother, plots mischief in Asgard, Thor, now stripped of his powers, faces his greatest threat.",
      "poster": "https://static.rogerebert.com/uploads/movie/movie_poster/thor-2011/large_jqcMUV73jEhO0gv5yi28FD8JbHQ.jpg",
      "trailer": "https://youtu.be/JOddp-nlNvQ"
    },
    {
      "id": "MOV10",
      "type": "movie",
      "title": "Black Panther",
      "year": "2018",
      "genre": "Action/Adventure",
      "rating": 7.3,
      "description": "After the death of his father, T'Challa returns home to the African nation of Wakanda to take his rightful place as king. When a powerful enemy suddenly reappears, T'Challa's mettle as king -- and as Black Panther -- gets tested when he's drawn into a conflict that puts the fate of Wakanda and the entire world at risk. Faced with treachery and danger, the young king must rally his allies and release the full power of Black Panther to defeat his foes and secure the safety of his people.",
      "poster": "https://media.comicbook.com/2017/12/new-black-panther-movie-poster-2018--1064120.jpg",
      "trailer": "https://youtu.be/xjDjIWPwcPU"
    }
  ],
  "tv_shows": [
    {
      "id": "TVS1",
      "type": "tv-show",
      "title": "Agents of S.H.I.E.L.D.",
      "year": "2013 - 2020",
      "genre": "Sci-fi",
      "rating": 7.5,
      "description": "Premise. The first season follows S.H.I.E.L.D. agent Phil Coulson as he puts together a small team of agents to handle strange new cases. ... During the third season, Coulson begins a secret mission to assemble the Secret Warriors, a team of Inhumans, as Hydra restores its ancient Inhuman leader Hive to power.",
      "poster": "https://images-na.ssl-images-amazon.com/images/I/81JX%2BiFGujL._SL1500_.jpg",
      "trailer": "https://youtu.be/A4du3_6QGm8"
    },
    {
      "id": "TVS2",
      "type": "tv-show",
      "title": "Inhumans",
      "year": "2017",
      "genre": "Sci-fi",
      "rating": 5.0,
      "description": "The series will follow the royal family of Inhumans, led by their King, Black Bolt (Anson Mount), after they are split up by a military coup and end up in Hawaii in the latest television series set in the Marvel Cinematic Universe.",
      "poster": "https://i.pinimg.com/originals/f7/5c/3d/f75c3d84d356e9f37a1b2bebb5943fde.jpg",
      "trailer": "https://youtu.be/1sYF1SXcWqQ"
    },
    {
      "id": "TVS3",
      "type": "tv-show",
      "title": "The Defenders",
      "year": "2017 - 2020",
      "genre": "Action/fiction",
      "rating": 7.3,
      "description": "Marvel's The Defenders follows Daredevil, Jessica Jones, Luke Cage and Iron Fist. A quartet of singular heroes with one common goal - to save New York City. This is the story of four solitary figures, burdened with their own personal challenges, who realize they just might be stronger when teamed together.",
      "poster": "https://i.pinimg.com/originals/f7/74/40/f77440c1aa0d1c112bf38d425955de08.jpg",
      "trailer": "https://youtu.be/KtsUFqZpCIw"
    },
    {
      "id": "TVS4",
      "type": "tv-show",
      "title": "The Punisher",
      "year": "2017 - 2020",
      "genre": "Action/fiction",
      "rating": 8.5,
      "description": "This dark action film, based on the comic book series, follows FBI agent Frank Castle (Thomas Jane) as he transforms into the vengeful Punisher after criminals murder his family, including his wife and son. Castle is gravely injured in the attack and believed to be dead by Howard Saint (John Travolta), the crime lord who ordered the hit. Following his recovery, Castle becomes a heavily armed vigilante who will stop at nothing to exact revenge on Saint and dismantle his underworld empire.",
      "poster": "https://images-na.ssl-images-amazon.com/images/I/719CPjM5twL._AC_SL1200_.jpg",
      "trailer": "https://youtu.be/C9A-tG_tPP4"
    },
    {
      "id": "TVS5",
      "type": "tv-show",
      "title": "Iron Fist",
      "year": "2017 - 2020",
      "genre": "Action/fiction",
      "rating": 6.5,
      "description": "The first season of the American streaming television series Iron Fist, which is based on the Marvel Comics character of the same name, follows Danny Rand as he returns to New York City after being presumed dead for 15 years and must choose between his family's legacy and his duties as the Iron Fist.",
      "poster": "https://i.pinimg.com/originals/9d/da/c7/9ddac714f57339f2f23c4aaf14204046.png",
      "trailer": "https://youtu.be/f9OKL5no-S0"
    },
    {
      "id": "TVS6",
      "type": "tv-show",
      "title": "Cloak & Dagger",
      "year": "2018 - 2020",
      "genre": "Superhero",
      "rating": 6.7,
      "description": "This live-action interracial romance follows Tandy Bowen and Tyrone Johnson, two teenagers from very different backgrounds, who find themselves burdened and awakened to newly acquired superpowers while falling in love. Tandy can emit light daggers and Tyrone has the ability to engulf others in darkness.",
      "poster": "https://i.pinimg.com/736x/89/29/0c/89290c2dd566636ed13e04b8db5c0e0f.jpg",
      "trailer": "https://youtu.be/5RJnZ1u1WFc"
    },
    {
      "id": "TVS7",
      "type": "tv-show",
      "title": "Jessica Jones",
      "year": "2015 - 2020",
      "genre": "Drama",
      "rating": 7.9,
      "description": "Plot. Jessica Jones is a super-powered woman who had a brief superhero career until an incident in which the villainous Kilgrave caused her to kill someone. After that incident, she became a private investigator. When Kilgrave resurfaces, Jessica must rise up to stop him.",
      "poster": "https://d1w8cc2yygc27j.cloudfront.net/-4157264040428098463/1193870767771905496.jpg",
      "trailer": "https://youtu.be/nWHUjuJ8zxE"
    },
    {
      "id": "TVS8",
      "type": "tv-show",
      "title": "Luke Cage",
      "year": "2016 - 2018",
      "genre": "Action/fiction",
      "rating": 7.3,
      "description": "Luke Cage, a former convict with superhuman strength and unbreakable skin, keeps a low profile as a sweeper at ex-gangster Henry \"Pop\" Hunter's barbershop, and as a dishwasher at crime boss Cornell \"Cottonmouth\" Stokes' nightclub, Harlem's Paradise.",
      "poster": "https://images-na.ssl-images-amazon.com/images/I/71xby-zAr7L._AC_SL1024_.jpg",
      "trailer": "https://youtu.be/ORa4hPhGrpo"
    },
    {
      "id": "TVS9",
      "type": "tv-show",
      "title": "Daredevil",
      "year": "2015 - 2020",
      "genre": "Action/fiction",
      "rating": 8.6,
      "description": "Attorney Matt Murdock (Ben Affleck) is blind, but his other four senses function with superhuman sharpness. By day, Murdock represents the downtrodden. At night, he is Daredevil, a masked vigilante, a relentless avenger of justice. When Wilson Fisk (Michael Clarke Duncan) hires Bullseye (Colin Farrell) to kill Daredevil, Murdock must rely on his own senses and search out the conspirators against justice -- which may include his own girlfriend, Elektra (Jennifer Garner).",
      "poster": "https://i.pinimg.com/originals/59/9e/bb/599ebbf39dd6e27626fa11548bf3cc68.jpg",
      "trailer": "https://youtu.be/jAy6NJ_D5vU"
    },
    {
      "id": "TVS10",
      "type": "tv-show",
      "title": "Runaways",
      "year": "2017 - 2020",
      "genre": "Superhero",
      "rating": 7.0,
      "description": "Runaways is a superhero comic book series published by Marvel Comics. The series features a group of teenagers who discover that their parents are part of an evil crime organization known as \"Pride\". ... Originally, the series featured a group of six kids whose parents routinely met every year for a charity event.",
      "poster": "https://images-na.ssl-images-amazon.com/images/I/71VXEY33YtL._AC_SL1000_.jpg",
      "trailer": "https://youtu.be/y-OJVwUG76k"
    }
  ]
}